// TODO: эквиваленци

// И
// Конъюнкция
fn and(a: i64, b: i64) {}

// ИЛИ
// Дизъюнкция
fn or(a: i64, b: i64) {}

// НЕ
// Логическое отрицание аргумента
// TODO: возвращение инвертированого значения аргумента
fn not(a: i64) {
    
}

// Предикат
fn Predicate(){

}

fn quantor_e() {}

fn quantor_a() {}

// х_принадлежит()
// TODO: параметр для функции - множество
fn x_appertain() {}

// для_всех_х().х_принадлжеит(А).следует()
// х.неравен(у)
// не().существует_х().х_принадлжеит(А)
// для_всех_х().х_принадлежит(А).и().х_принадлежит(В).тогда(х.принадлежит(С))
